# frozen_string_literal: true

module TextHelper
  module_function

  def initial_request_info
    "Будь ласка скажіть де ви і чи потрібна вам допомога?"
  end

  def help
    <<-TEXT
Бот #{bot_username} допомогає группам людей (коллегам, сім'ям, друзям, тощо) знати де знаходиться кожен із них.

#{available_commands}

Для початку роботи:
1. Додайте #{bot_username} до бажанної групи (або натисніть на #{add_to_group_link} та виберіть группу)
2. Всі бажаючі повинні додати себе до опитувального листа ввівши /start або /start#{bot_username} у чаті группи
3. Надайте боту інформацію про місцезнаходження та чи потрібна вам допомога
4. Введіть /stat у чаті группи щоб побачити 

У приватному чаті:
Один раз на день бот буде просити вас актуалізувати інформацію щодо місцезнаходження та допомоги. 
Данні які треба актуалізувати будут помічені жовтим трикутником.
Ввівши /menu ви можете актуалізувати свої данні раніше цього часу.
Щоб побачити в яких опитівальних листах ви є введіть /my_groups

У групповому чаті:
Один раз на день бот буде писати місцезнаходження всіх користувачів з опитувального листа. 
Шоб побачити цю інформацію раніше введіть /stat

Завершення роботи:
Щоб видалити себе з опитувального листа конкретної группи введіть /stop у чаті группи. 
Щоб видалити себе зі всіх опитувальних листів цього бота введіть /stop у приватному чаті бота.
Щоб видалили опитівальний лист группи видаліть бота з группи.
    TEXT
  end

  def available_commands
    <<-TEXT
Доступні команди:
/start - Додати себе до опитувального листа цієї группи (тільки у чаті группі в яку додан #{bot_username})
/stop - Видалити себе з опитувального листа цієї группи (у чаті группі в яку додан #{bot_username}), або всіх групп (у чаті з #{bot_username})
/stat - Побачити опитівальний лист цієї группи (тільки у чаті группі в яку додан #{bot_username})
/help - Побачити список доступних команд
/my_groups - Побачити в якіх группах ви є у опитувальному листі (тільки у чаті з #{bot_username})
/menu - Побачити меню актуалізації інформації (тільки у чаті з #{bot_username})
    TEXT
  end

  def bot_username
    "@#{Application.bot_info.username}"
  end

  def add_to_group_link
    "https://t.me/#{Application.bot_info.username}?startgroup"
  end
end
